OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18lf27j53.h
/*
 * This declarations of the PIC18LF27J53 MCU.
 *
 * This file is part of the GNU PIC library for SDCC, originally
 * created by Molnar Karoly <molnarkaroly@users.sf.net> 2016.
 *
 * This file is generated automatically by the cinc2h.pl, 2016-04-13 17:23:55 UTC.
 *
 * SDCC is licensed under the GNU Public license (GPL) v2. Note that
 * this license covers the code to the compiler and other executables,
 * but explicitly does not cover any code or objects generated by sdcc.
 *
 * For pic device libraries and header files which are derived from
 * Microchip header (.inc) and linker script (.lkr) files Microchip
 * requires that "The header files should state that they are only to be
 * used with authentic Microchip devices" which makes them incompatible
 * with the GPL. Pic device libraries and header files are located at
 * non-free/lib and non-free/include directories respectively.
 * Sdcc should be run with the --use-non-free command line option in
 * order to include non-free header files and libraries.
 *
 * See http://sdcc.sourceforge.net/ for the latest information on sdcc.
 */

#ifndef __PIC18LF27J53_H__
#define __PIC18LF27J53_H__

//==============================================================================

//==============================================================================
//
//	Register Definitions
//
//==============================================================================


//==============================================================================
//        ADCTRIG Bits

extern __at(0x0EB8) __sfr ADCTRIG;

typedef union
  {
  struct
    {
    unsigned SRC0               : 1;
    unsigned SRC1               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned TRIGSEL0           : 1;
    unsigned TRIGSEL1           : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned TRIGSEL            : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned SRC                : 2;
    unsigned                    : 6;
    };
  } __ADCTRIGbits_t;

extern __at(0x0EB8) volatile __ADCTRIGbits_t ADCTRIGbits;

#define _SRC0                   0x01
#define _TRIGSEL0               0x01
#define _SRC1                   0x02
#define _TRIGSEL1               0x02

//==============================================================================


//==============================================================================
//        PD0 Bits

extern __at(0x0EB9) __sfr PD0;

typedef union
  {
  struct
    {
    unsigned ADCMD              : 1;
    unsigned SPI1MD             : 1;
    unsigned SPI2MD             : 1;
    unsigned UART1MD            : 1;
    unsigned UART2MD            : 1;
    unsigned ECCP1MD            : 1;
    unsigned ECCP2MD            : 1;
    unsigned ECCP3MD            : 1;
    };

  struct
    {
    unsigned PMDADC             : 1;
    unsigned PMDMSSP1           : 1;
    unsigned PMDMSSP2           : 1;
    unsigned PMDUART1           : 1;
    unsigned PMDUART2           : 1;
    unsigned PMDECCP1           : 1;
    unsigned PMDECCP2           : 1;
    unsigned PMDECCP3           : 1;
    };
  } __PD0bits_t;

extern __at(0x0EB9) volatile __PD0bits_t PD0bits;

#define _ADCMD                  0x01
#define _PMDADC                 0x01
#define _SPI1MD                 0x02
#define _PMDMSSP1               0x02
#define _SPI2MD                 0x04
#define _PMDMSSP2               0x04
#define _UART1MD                0x08
#define _PMDUART1               0x08
#define _UART2MD                0x10
#define _PMDUART2               0x10
#define _ECCP1MD                0x20
#define _PMDECCP1               0x20
#define _ECCP2MD                0x40
#define _PMDECCP2               0x40
#define _ECCP3MD                0x80
#define _PMDECCP3               0x80

//==============================================================================


//==============================================================================
//        PMDIS0 Bits

extern __at(0x0EB9) __sfr PMDIS0;

typedef union
  {
  struct
    {
    unsigned ADCMD              : 1;
    unsigned SPI1MD             : 1;
    unsigned SPI2MD             : 1;
    unsigned UART1MD            : 1;
    unsigned UART2MD            : 1;
    unsigned ECCP1MD            : 1;
    unsigned ECCP2MD            : 1;
    unsigned ECCP3MD            : 1;
    };

  struct
    {
    unsigned PMDADC             : 1;
    unsigned PMDMSSP1           : 1;
    unsigned PMDMSSP2           : 1;
    unsigned PMDUART1           : 1;
    unsigned PMDUART2           : 1;
    unsigned PMDECCP1           : 1;
    unsigned PMDECCP2           : 1;
    unsigned PMDECCP3           : 1;
    };
  } __PMDIS0bits_t;

extern __at(0x0EB9) volatile __PMDIS0bits_t PMDIS0bits;

#define _PMDIS0_ADCMD           0x01
#define _PMDIS0_PMDADC          0x01
#define _PMDIS0_SPI1MD          0x02
#define _PMDIS0_PMDMSSP1        0x02
#define _PMDIS0_SPI2MD          0x04
#define _PMDIS0_PMDMSSP2        0x04
#define _PMDIS0_UART1MD         0x08
#define _PMDIS0_PMDUART1        0x08
#define _PMDIS0_UART2MD         0x10
#define _PMDIS0_PMDUART2        0x10
#define _PMDIS0_ECCP1MD         0x20
#define _PMDIS0_PMDECCP1        0x20
#define _PMDIS0_ECCP2MD         0x40
#define _PMDIS0_PMDECCP2        0x40
#define _PMDIS0_ECCP3MD         0x80
#define _PMDIS0_PMDECCP3        0x80

//==============================================================================


//==============================================================================
//        PD1 Bits

extern __at(0x0EBA) __sfr PD1;

typedef union
  {
  struct
    {
    unsigned                    : 1;
    unsigned TMR1MD             : 1;
    unsigned TMR2MD             : 1;
    unsigned TMR3MD             : 1;
    unsigned TMR4MD             : 1;
    unsigned RTCCMD             : 1;
    unsigned CTMUMD             : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned PMDTMR1            : 1;
    unsigned PMDTMR2            : 1;
    unsigned PMDTMR3            : 1;
    unsigned PMDTMR4            : 1;
    unsigned PMDRTCC            : 1;
    unsigned PMDCTMU            : 1;
    unsigned                    : 1;
    };
  } __PD1bits_t;

extern __at(0x0EBA) volatile __PD1bits_t PD1bits;

